/**
 * Передача за посиланням і за значенням
 *
 * Примітиви і складні типи
 * Посилальна рівність (referential equality)
 */

//!=========================================

// const arr = [10, 20, 30];

// arr[0];

// arr[0] = 'Hello';
// arr[1];
// arr[-1];

//!=========================================
// const a = [1, 2, 3];
// const b = a;

// console.log('a', a);
// console.log('b', b);

// a[0] = 500;

// console.log('a', a);
// console.log('b', b);

// console.log(a === b);

// console.log([] === []);
// console.log([1, 2, 3] === [1, 2, 3]);

// const a = [1, 2, 3];
// const b = [1, 2, 3];

// console.log(a === b);

//!=========================================
