/**
 * Ітерація по масиву
 *
 * - Ітерація по масиву циклом for
 * - Метод includes
 * - Цикл for...of
 * - Різниця у використанні for и for...of
 */
//!=========================================
// Використовуємо такий фор лише якщо потрібні індекси. Або якщо плануєте змінювати масив

// const fruits = ['🍎', '🍇', '🍑', '🍌', '🍋'];
// for (let i = 0; i < fruits.length; i++) {
//   console.log(i, fruits[i]);
// }

//!=========================================
// const friends = ['Mango', 'Kiwi', 'Poly', 'Ajax'];

// for (const item of friends) {
//   console.log(item);
// }

//!=========================================

/**
 * Напиши скрипт для обчислення площі прямокутника зі сторонами,
 * значення яких зберігаються у змінній values у вигляді рядка.
 * Значення гарантовано розділені пробілом.
 */

// const values = '8 11';
// const arr = values.split(' '); // ['8', '11']
// const height = arr[0]; // '8'
// const width = arr[1]; // '11'
// const area = height * width;
// console.log(area);

//!=========================================
/**
 * Напиши скрипт для перебору масиву fruits.
 * Для кожного елемента масиву виведи в консоль рядок
 * у форматі номер_елемента: значення_елемента.
 * Нумерація елементів повинна починатися з 1.
 */

// const fruits = ['🍎', '🍇', '🍑', '🍌', '🍋'];
// for (let i = 0; i < fruits.length; i++) {
//   console.log(`${i + 1}: ${fruits[i]}`);
// }
