/**
 * Напиши скрипт, який підраховує суму всіх парних чисел у масиві.
 */

//!=========================================
// const numbers = [1, 5, 8, 9, 12, 4, 15, 27, 30, 18, 14];
// let total = 8;

// for (const elem of numbers) {
//   if (elem % 2 === 0) {
//     total += elem;
//   }
// }

// console.log(total);

//!=========================================
/**
 * Напиши скрипт, який виводить у консоль усі слова рядка
 * крім першого і останнього. Результуючий рядок не повинен починатися
 * або закінчуватися символ пробілу.
 * Скрипт повинен працювати для будь-якого рядка.
 */

// const string = 'Start Welcome to the future end';
// const arr = string.split(' ').slice(1, -1);

// for (const item of arr) {
//   console.log(item);
// }

//!=========================================
/**
 * Напиши скрипт пошуку найменшого числа у масиві. Код повинен працювати
 * для будь-якого масиву чисел. Використовуй цикл для розв'язання задачі.
 */

// const values = [2, 17, 94, 1, 23, 37];
// let min;
// console.log(min); // 1
